apache/nuttx/arch/arm/src/common/stm32/stm32_rtcc_m3m4_l1.c
  DEBUGASSERT(tp != NULL);

  /* Sample the data time register. */

  data = getreg32(reg);

  /* Convert the RTC time to fields in struct tm format.  All of the STM32
   * ranges of values correspond between struct tm and the time register.
   */

  tmp = (data & (RTC_ALRMR_SU_MASK | RTC_ALRMR_ST_MASK)) >>
        RTC_ALRMR_SU_SHIFT;
  tp->tm_sec = rtc_bcd2bin(tmp);

  tmp = (data & (RTC_ALRMR_MNU_MASK | RTC_ALRMR_MNT_MASK)) >>
        RTC_ALRMR_MNU_SHIFT;
  tp->tm_min = rtc_bcd2bin(tmp);

  tmp = (data & (RTC_ALRMR_HU_MASK | RTC_ALRMR_HT_MASK)) >>
        RTC_ALRMR_HU_SHIFT;
  tp->tm_hour = rtc_bcd2bin(tmp);

  tmp = (data & (RTC_ALRMR_DU_MASK | RTC_ALRMR_DT_MASK)) >>
        RTC_ALRMR_DU_SHIFT;
  tp->tm_mday = rtc_bcd2bin(tmp);

  return OK;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_rtc_is_initialized
 *
 * Description:
 *    Returns 'true' if the RTC has been initialized
 *    Returns 'false' if the RTC has never been initialized since first time
 *    power up, and the counters are stopped until it is first initialized.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Returns true if RTC has been initialized.
 *
 ****************************************************************************/

bool stm32_rtc_is_initialized(void)
{
  uint32_t regval;

  regval = getreg32(RTC_MAGIC_REG);

  return regval == RTC_MAGIC || regval == RTC_MAGIC_TIME_SET;
}

/****************************************************************************
 * Name: up_rtc_initialize
 *
 * Description:
 *   Initialize the hardware RTC per the selected configuration.  This
 *   function is called once during the OS initialization sequence
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

int up_rtc_initialize(void)
{
  bool init_stat;
  uint32_t regval;

  rtc_dumpregs("Before Initialization");

  /* See if the clock has already been initialized; since it is battery
   * backed, we don't need or want to re-initialize on each reset.
   */

  init_stat = stm32_rtc_is_initialized();
  if (!init_stat)
    {
      /* Enable write access to the backup domain (RTC registers, RTC
       * backup data registers and backup SRAM).
       */

      stm32_pwr_enablebkp(true);

#if defined(CONFIG_STM32_RTC_HSECLOCK)
      modifyreg32(STM32_RCC_CSR, RCC_CSR_RTCSEL_MASK, RCC_CSR_RTCSEL_HSE);
#elif defined(CONFIG_STM32_RTC_LSICLOCK)
      modifyreg32(STM32_RCC_CSR, RCC_CSR_RTCSEL_MASK, RCC_CSR_RTCSEL_LSI);
#elif defined(CONFIG_STM32_RTC_LSECLOCK)
      modifyreg32(STM32_RCC_CSR, RCC_CSR_RTCSEL_MASK, RCC_CSR_RTCSEL_LSE);
#else
#  error "No clock for RTC!"
#endif

      /* Enable the RTC Clock by setting the RTCEN bit in the CSR register */

      modifyreg32(STM32_RCC_CSR, 0, RCC_CSR_RTCEN);

      /* Disable the write protection for RTC registers */

      rtc_wprunlock();

      /* Set Initialization mode */

      if (OK != rtc_enterinit())
        {
          /* Enable the write protection for RTC registers */

          rtc_wprlock();

          /* Disable write access to the backup domain (RTC registers, RTC
           * backup data registers and backup SRAM).
           */

          stm32_pwr_enablebkp(false);

          rtc_dumpregs("After Failed Initialization");

          return ERROR;
        }
      else
        {
          /* Clear RTC_CR FMT, OSEL and POL Bits */

          regval = getreg32(STM32_RTC_CR);
          regval &= ~(RTC_CR_FMT | RTC_CR_OSEL_MASK | RTC_CR_POL);
          putreg32(regval, STM32_RTC_CR);

          /* Configure RTC pre-scaler with the required values */

#ifdef CONFIG_STM32_RTC_HSECLOCK
          /* The HSE is divided by 32 prior to the prescaler we set here.
           *
           * NOTE: max HSE/32 is 4 MHz if it is to be used with RTC
           */

          /* For a 1 MHz clock this yields 0.9999360041 Hz on the second
           * timer - which is pretty close.
           */

          putreg32(((uint32_t)7812 << RTC_PRER_PREDIV_S_SHIFT) |
                  ((uint32_t)0x7f << RTC_PRER_PREDIV_A_SHIFT),
                  STM32_RTC_PRER);
#elif defined(CONFIG_STM32_RTC_LSICLOCK)
          /* Suitable values for 32.000 KHz LSI clock
           * (29.5 - 34 KHz, though)
           */

          putreg32(((uint32_t)0xf9 << RTC_PRER_PREDIV_S_SHIFT) |
                  ((uint32_t)0x7f << RTC_PRER_PREDIV_A_SHIFT),
                  STM32_RTC_PRER);
#else /* defined(CONFIG_STM32_RTC_LSECLOCK) */
          /* Correct values for 32.768 KHz LSE clock */

          putreg32(((uint32_t)0xff << RTC_PRER_PREDIV_S_SHIFT) |
                  ((uint32_t)0x7f << RTC_PRER_PREDIV_A_SHIFT),
                  STM32_RTC_PRER);
#endif

          /* Exit Initialization mode */

          rtc_exitinit();

          /* Wait for the RTC Time and Date registers to be synchronized
           * with RTC APB clock.
           */

          rtc_synchwait();

          /* Keep the fact that the RTC is initialized */

          putreg32(RTC_MAGIC, RTC_MAGIC_REG);

          /* Enable the write protection for RTC registers */

          rtc_wprlock();

          /* Disable write access to the backup domain (RTC registers, RTC
           * backup data registers and backup SRAM).
           */

          stm32_pwr_enablebkp(false);
        }
    }
  else
    {
      /* Enable write access to the backup domain (RTC registers, RTC
       * backup data registers and backup SRAM).
       */

      stm32_pwr_enablebkp(true);

      /* Write protection for RTC registers does not need to be disabled. */

      rtc_resume();

      /* Disable write access to the backup domain (RTC registers, RTC backup
       * data registers and backup SRAM).
       */

      stm32_pwr_enablebkp(false);
    }

